{
  "char2idx": {
    "\u0000": 0,
    "\n": 1,
    " ": 2,
    "!": 3,
    "\"": 4,
    "#": 5,
    "$": 6,
    "%": 7,
    "&": 8,
    "'": 9,
    "(": 10,
    ")": 11,
    "+": 12,
    ",": 13,
    "-": 14,
    ".": 15,
    "/": 16,
    "0": 17,
    "1": 18,
    "2": 19,
    "3": 20,
    "4": 21,
    "5": 22,
    "6": 23,
    "7": 24,
    "8": 25,
    "9": 26,
    ":": 27,
    ";": 28,
    "<": 29,
    "=": 30,
    ">": 31,
    "?": 32,
    "A": 33,
    "B": 34,
    "C": 35,
    "D": 36,
    "E": 37,
    "F": 38,
    "G": 39,
    "H": 40,
    "I": 41,
    "J": 42,
    "K": 43,
    "L": 44,
    "M": 45,
    "N": 46,
    "O": 47,
    "P": 48,
    "Q": 49,
    "R": 50,
    "S": 51,
    "T": 52,
    "U": 53,
    "V": 54,
    "W": 55,
    "X": 56,
    "Y": 57,
    "Z": 58,
    "[": 59,
    "\\": 60,
    "_": 61,
    "`": 62,
    "a": 63,
    "b": 64,
    "c": 65,
    "d": 66,
    "e": 67,
    "f": 68,
    "g": 69,
    "h": 70,
    "i": 71,
    "j": 72,
    "k": 73,
    "l": 74,
    "m": 75,
    "n": 76,
    "o": 77,
    "p": 78,
    "q": 79,
    "r": 80,
    "s": 81,
    "t": 82,
    "u": 83,
    "v": 84,
    "w": 85,
    "x": 86,
    "y": 87,
    "z": 88,
    "|": 89,
    "}": 90,
    "~": 91,
    "£": 92,
    "§": 93,
    "¨": 94,
    "®": 95,
    "¯": 96,
    "°": 97,
    "±": 98,
    "´": 99,
    "·": 100,
    "¸": 101,
    "¿": 102,
    "Á": 103,
    "×": 104,
    "Ø": 105,
    "Ü": 106,
    "à": 107,
    "á": 108,
    "â": 109,
    "ä": 110,
    "å": 111,
    "ç": 112,
    "è": 113,
    "é": 114,
    "í": 115,
    "ï": 116,
    "ñ": 117,
    "ó": 118,
    "ö": 119,
    "ù": 120,
    "ú": 121,
    "û": 122,
    "ü": 123,
    "Ł": 124,
    "ł": 125,
    "š": 126,
    "ž": 127,
    "ˆ": 128,
    "ˇ": 129,
    "˘": 130,
    "˚": 131,
    "˜": 132,
    "̸": 133,
    "Σ": 134,
    "α": 135,
    "β": 136,
    "γ": 137,
    "δ": 138,
    "θ": 139,
    "κ": 140,
    "λ": 141,
    "π": 142,
    "ρ": 143,
    "σ": 144,
    "τ": 145,
    "ψ": 146,
    "ϕ": 147,
    "В": 148,
    "О": 149,
    "П": 150,
    "а": 151,
    "б": 152,
    "в": 153,
    "д": 154,
    "е": 155,
    "ж": 156,
    "з": 157,
    "и": 158,
    "й": 159,
    "к": 160,
    "л": 161,
    "м": 162,
    "н": 163,
    "о": 164,
    "п": 165,
    "р": 166,
    "с": 167,
    "т": 168,
    "у": 169,
    "ф": 170,
    "х": 171,
    "ц": 172,
    "ч": 173,
    "щ": 174,
    "ы": 175,
    "ь": 176,
    "э": 177,
    "я": 178,
    "᠃": 179,
    "᠍": 180,
    "ᠠ": 181,
    "ᠡ": 182,
    "ᠢ": 183,
    "ᠣ": 184,
    "ᠤ": 185,
    "ᠥ": 186,
    "ᠦ": 187,
    "ᠨ": 188,
    "ᠪ": 189,
    "ᠬ": 190,
    "ᠭ": 191,
    "ᠮ": 192,
    "ᠯ": 193,
    "ᠰ": 194,
    "ᠲ": 195,
    "ᠳ": 196,
    "ᠴ": 197,
    "ᠵ": 198,
    "ᠶ": 199,
    "ᠷ": 200,
    "–": 201,
    "—": 202,
    "‘": 203,
    "’": 204,
    "“": 205,
    "”": 206,
    "†": 207,
    "‡": 208,
    "•": 209,
    "…": 210,
    "′": 211,
    "ℓ": 212,
    "™": 213,
    "←": 214,
    "↑": 215,
    "→": 216,
    "↓": 217,
    "∀": 218,
    "∆": 219,
    "∈": 220,
    "−": 221,
    "∗": 222,
    "∥": 223,
    "∩": 224,
    "∪": 225,
    "∼": 226,
    "≈": 227,
    "≤": 228,
    "≥": 229,
    "⊤": 230,
    "⋆": 231,
    "①": 232,
    "②": 233,
    "③": 234,
    "④": 235,
    "▷": 236,
    "◁": 237,
    "●": 238,
    "◦": 239,
    "♡": 240,
    "♢": 241,
    "♣": 242,
    "⚙": 243,
    "✓": 244,
    "✗": 245,
    "➀": 246,
    "➁": 247,
    "➃": 248,
    "➄": 249,
    "➅": 250,
    "⟨": 251,
    "⟩": 252,
    "⽣": 253,
    "、": 254,
    "。": 255,
    "あ": 256,
    "い": 257,
    "う": 258,
    "え": 259,
    "が": 260,
    "く": 261,
    "け": 262,
    "し": 263,
    "じ": 264,
    "す": 265,
    "た": 266,
    "っ": 267,
    "て": 268,
    "で": 269,
    "と": 270,
    "ど": 271,
    "な": 272,
    "に": 273,
    "の": 274,
    "は": 275,
    "べ": 276,
    "ま": 277,
    "も": 278,
    "ゆ": 279,
    "よ": 280,
    "ら": 281,
    "る": 282,
    "れ": 283,
    "わ": 284,
    "を": 285,
    "コ": 286,
    "シ": 287,
    "ズ": 288,
    "タ": 289,
    "ピ": 290,
    "プ": 291,
    "ュ": 292,
    "リ": 293,
    "ル": 294,
    "ン": 295,
    "ー": 296,
    "一": 297,
    "上": 298,
    "下": 299,
    "不": 300,
    "业": 301,
    "个": 302,
    "中": 303,
    "了": 304,
    "事": 305,
    "些": 306,
    "产": 307,
    "今": 308,
    "代": 309,
    "以": 310,
    "件": 311,
    "企": 312,
    "会": 313,
    "供": 314,
    "依": 315,
    "候": 316,
    "傘": 317,
    "全": 318,
    "关": 319,
    "具": 320,
    "出": 321,
    "则": 322,
    "判": 323,
    "力": 324,
    "功": 325,
    "効": 326,
    "午": 327,
    "协": 328,
    "単": 329,
    "压": 330,
    "原": 331,
    "发": 332,
    "受": 333,
    "口": 334,
    "可": 335,
    "合": 336,
    "向": 337,
    "善": 338,
    "器": 339,
    "国": 340,
    "在": 341,
    "壓": 342,
    "备": 343,
    "多": 344,
    "天": 345,
    "奸": 346,
    "学": 347,
    "安": 348,
    "実": 349,
    "家": 350,
    "导": 351,
    "工": 352,
    "已": 353,
    "布": 354,
    "师": 355,
    "带": 356,
    "帶": 357,
    "常": 358,
    "度": 359,
    "强": 360,
    "律": 361,
    "得": 362,
    "心": 363,
    "思": 364,
    "成": 365,
    "所": 366,
    "批": 367,
    "技": 368,
    "把": 369,
    "指": 370,
    "提": 371,
    "摄": 372,
    "攝": 373,
    "改": 374,
    "数": 375,
    "时": 376,
    "是": 377,
    "晚": 378,
    "暴": 379,
    "最": 380,
    "會": 381,
    "条": 382,
    "来": 383,
    "果": 384,
    "案": 385,
    "正": 386,
    "武": 387,
    "氏": 388,
    "氣": 389,
    "水": 390,
    "沸": 391,
    "法": 392,
    "溉": 393,
    "灌": 394,
    "犯": 395,
    "率": 396,
    "現": 397,
    "理": 398,
    "百": 399,
    "的": 400,
    "确": 401,
    "立": 402,
    "純": 403,
    "组": 404,
    "织": 405,
    "经": 406,
    "给": 407,
    "罪": 408,
    "能": 409,
    "術": 410,
    "見": 411,
    "記": 412,
    "車": 413,
    "这": 414,
    "进": 415,
    "通": 416,
    "関": 417,
    "闭": 418,
    "问": 419,
    "雨": 420,
    "非": 421,
    "题": 422,
    "騰": 423,
    "": 424,
    "": 425,
    "": 426,
    "": 427,
    "！": 428,
    "，": 429,
    "👾": 430,
    "🤖": 431
  },
  "idx2char": {
    "0": "\u0000",
    "1": "\n",
    "2": " ",
    "3": "!",
    "4": "\"",
    "5": "#",
    "6": "$",
    "7": "%",
    "8": "&",
    "9": "'",
    "10": "(",
    "11": ")",
    "12": "+",
    "13": ",",
    "14": "-",
    "15": ".",
    "16": "/",
    "17": "0",
    "18": "1",
    "19": "2",
    "20": "3",
    "21": "4",
    "22": "5",
    "23": "6",
    "24": "7",
    "25": "8",
    "26": "9",
    "27": ":",
    "28": ";",
    "29": "<",
    "30": "=",
    "31": ">",
    "32": "?",
    "33": "A",
    "34": "B",
    "35": "C",
    "36": "D",
    "37": "E",
    "38": "F",
    "39": "G",
    "40": "H",
    "41": "I",
    "42": "J",
    "43": "K",
    "44": "L",
    "45": "M",
    "46": "N",
    "47": "O",
    "48": "P",
    "49": "Q",
    "50": "R",
    "51": "S",
    "52": "T",
    "53": "U",
    "54": "V",
    "55": "W",
    "56": "X",
    "57": "Y",
    "58": "Z",
    "59": "[",
    "60": "\\",
    "61": "_",
    "62": "`",
    "63": "a",
    "64": "b",
    "65": "c",
    "66": "d",
    "67": "e",
    "68": "f",
    "69": "g",
    "70": "h",
    "71": "i",
    "72": "j",
    "73": "k",
    "74": "l",
    "75": "m",
    "76": "n",
    "77": "o",
    "78": "p",
    "79": "q",
    "80": "r",
    "81": "s",
    "82": "t",
    "83": "u",
    "84": "v",
    "85": "w",
    "86": "x",
    "87": "y",
    "88": "z",
    "89": "|",
    "90": "}",
    "91": "~",
    "92": "£",
    "93": "§",
    "94": "¨",
    "95": "®",
    "96": "¯",
    "97": "°",
    "98": "±",
    "99": "´",
    "100": "·",
    "101": "¸",
    "102": "¿",
    "103": "Á",
    "104": "×",
    "105": "Ø",
    "106": "Ü",
    "107": "à",
    "108": "á",
    "109": "â",
    "110": "ä",
    "111": "å",
    "112": "ç",
    "113": "è",
    "114": "é",
    "115": "í",
    "116": "ï",
    "117": "ñ",
    "118": "ó",
    "119": "ö",
    "120": "ù",
    "121": "ú",
    "122": "û",
    "123": "ü",
    "124": "Ł",
    "125": "ł",
    "126": "š",
    "127": "ž",
    "128": "ˆ",
    "129": "ˇ",
    "130": "˘",
    "131": "˚",
    "132": "˜",
    "133": "̸",
    "134": "Σ",
    "135": "α",
    "136": "β",
    "137": "γ",
    "138": "δ",
    "139": "θ",
    "140": "κ",
    "141": "λ",
    "142": "π",
    "143": "ρ",
    "144": "σ",
    "145": "τ",
    "146": "ψ",
    "147": "ϕ",
    "148": "В",
    "149": "О",
    "150": "П",
    "151": "а",
    "152": "б",
    "153": "в",
    "154": "д",
    "155": "е",
    "156": "ж",
    "157": "з",
    "158": "и",
    "159": "й",
    "160": "к",
    "161": "л",
    "162": "м",
    "163": "н",
    "164": "о",
    "165": "п",
    "166": "р",
    "167": "с",
    "168": "т",
    "169": "у",
    "170": "ф",
    "171": "х",
    "172": "ц",
    "173": "ч",
    "174": "щ",
    "175": "ы",
    "176": "ь",
    "177": "э",
    "178": "я",
    "179": "᠃",
    "180": "᠍",
    "181": "ᠠ",
    "182": "ᠡ",
    "183": "ᠢ",
    "184": "ᠣ",
    "185": "ᠤ",
    "186": "ᠥ",
    "187": "ᠦ",
    "188": "ᠨ",
    "189": "ᠪ",
    "190": "ᠬ",
    "191": "ᠭ",
    "192": "ᠮ",
    "193": "ᠯ",
    "194": "ᠰ",
    "195": "ᠲ",
    "196": "ᠳ",
    "197": "ᠴ",
    "198": "ᠵ",
    "199": "ᠶ",
    "200": "ᠷ",
    "201": "–",
    "202": "—",
    "203": "‘",
    "204": "’",
    "205": "“",
    "206": "”",
    "207": "†",
    "208": "‡",
    "209": "•",
    "210": "…",
    "211": "′",
    "212": "ℓ",
    "213": "™",
    "214": "←",
    "215": "↑",
    "216": "→",
    "217": "↓",
    "218": "∀",
    "219": "∆",
    "220": "∈",
    "221": "−",
    "222": "∗",
    "223": "∥",
    "224": "∩",
    "225": "∪",
    "226": "∼",
    "227": "≈",
    "228": "≤",
    "229": "≥",
    "230": "⊤",
    "231": "⋆",
    "232": "①",
    "233": "②",
    "234": "③",
    "235": "④",
    "236": "▷",
    "237": "◁",
    "238": "●",
    "239": "◦",
    "240": "♡",
    "241": "♢",
    "242": "♣",
    "243": "⚙",
    "244": "✓",
    "245": "✗",
    "246": "➀",
    "247": "➁",
    "248": "➃",
    "249": "➄",
    "250": "➅",
    "251": "⟨",
    "252": "⟩",
    "253": "⽣",
    "254": "、",
    "255": "。",
    "256": "あ",
    "257": "い",
    "258": "う",
    "259": "え",
    "260": "が",
    "261": "く",
    "262": "け",
    "263": "し",
    "264": "じ",
    "265": "す",
    "266": "た",
    "267": "っ",
    "268": "て",
    "269": "で",
    "270": "と",
    "271": "ど",
    "272": "な",
    "273": "に",
    "274": "の",
    "275": "は",
    "276": "べ",
    "277": "ま",
    "278": "も",
    "279": "ゆ",
    "280": "よ",
    "281": "ら",
    "282": "る",
    "283": "れ",
    "284": "わ",
    "285": "を",
    "286": "コ",
    "287": "シ",
    "288": "ズ",
    "289": "タ",
    "290": "ピ",
    "291": "プ",
    "292": "ュ",
    "293": "リ",
    "294": "ル",
    "295": "ン",
    "296": "ー",
    "297": "一",
    "298": "上",
    "299": "下",
    "300": "不",
    "301": "业",
    "302": "个",
    "303": "中",
    "304": "了",
    "305": "事",
    "306": "些",
    "307": "产",
    "308": "今",
    "309": "代",
    "310": "以",
    "311": "件",
    "312": "企",
    "313": "会",
    "314": "供",
    "315": "依",
    "316": "候",
    "317": "傘",
    "318": "全",
    "319": "关",
    "320": "具",
    "321": "出",
    "322": "则",
    "323": "判",
    "324": "力",
    "325": "功",
    "326": "効",
    "327": "午",
    "328": "协",
    "329": "単",
    "330": "压",
    "331": "原",
    "332": "发",
    "333": "受",
    "334": "口",
    "335": "可",
    "336": "合",
    "337": "向",
    "338": "善",
    "339": "器",
    "340": "国",
    "341": "在",
    "342": "壓",
    "343": "备",
    "344": "多",
    "345": "天",
    "346": "奸",
    "347": "学",
    "348": "安",
    "349": "実",
    "350": "家",
    "351": "导",
    "352": "工",
    "353": "已",
    "354": "布",
    "355": "师",
    "356": "带",
    "357": "帶",
    "358": "常",
    "359": "度",
    "360": "强",
    "361": "律",
    "362": "得",
    "363": "心",
    "364": "思",
    "365": "成",
    "366": "所",
    "367": "批",
    "368": "技",
    "369": "把",
    "370": "指",
    "371": "提",
    "372": "摄",
    "373": "攝",
    "374": "改",
    "375": "数",
    "376": "时",
    "377": "是",
    "378": "晚",
    "379": "暴",
    "380": "最",
    "381": "會",
    "382": "条",
    "383": "来",
    "384": "果",
    "385": "案",
    "386": "正",
    "387": "武",
    "388": "氏",
    "389": "氣",
    "390": "水",
    "391": "沸",
    "392": "法",
    "393": "溉",
    "394": "灌",
    "395": "犯",
    "396": "率",
    "397": "現",
    "398": "理",
    "399": "百",
    "400": "的",
    "401": "确",
    "402": "立",
    "403": "純",
    "404": "组",
    "405": "织",
    "406": "经",
    "407": "给",
    "408": "罪",
    "409": "能",
    "410": "術",
    "411": "見",
    "412": "記",
    "413": "車",
    "414": "这",
    "415": "进",
    "416": "通",
    "417": "関",
    "418": "闭",
    "419": "问",
    "420": "雨",
    "421": "非",
    "422": "题",
    "423": "騰",
    "424": "",
    "425": "",
    "426": "",
    "427": "",
    "428": "！",
    "429": "，",
    "430": "👾",
    "431": "🤖"
  },
  "vocab_size": 432
}